anthropic.claude-code
charliermarsh.ruff
james-yu.latex-workshop
mathematic.vscode-latex
mechatroner.rainbow-csv
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
mtxr.sqltools
rodolphebarbanneau.python-docstring-highlighter
searking.preview-vscode
shd101wyy.markdown-preview-enhanced
tialki.tex-preview
torn4dom4n.latex-support
vscjava.migrate-java-to-azure
